Revit 2027 API
ParameterTypeId.KeySourceParam Property
 "Key Source"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KeySourceParam { get; }
Public Shared ReadOnly Property KeySourceParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KeySourceParam {
	ForgeTypeId^ get ();
}
static member KeySourceParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace